{
  "Question": "<p>I am a Software Engineering student and this year I learned about how CPUs work, it turns out that electronic engineers and I also see it a lot in my field, we do use derivatives with discontinuous functions. For instance in order to calculate the optimal amount of ripple adders so as to minimise the execution time of the addition process:</p> <p><span class=\"math-container\" id=\"q_679\">$$\\text{ExecutionTime}(n, k) = \\Delta(4k+\\frac{2n}{k}-4)$$</span> <span class=\"math-container\" id=\"q_680\">$$\\frac{d\\,\\text{ExecutionTime}(n, k)}{dk}=4\\Delta-\\frac{2n\\Delta}{k^2}=0$$</span> <span class=\"math-container\" id=\"q_681\">$$k= \\sqrt{\\frac{n}{2}}$$</span></p> <p>where <span class=\"math-container\" id=\"q_682\">$n$</span> is the number of bits in the numbers to add, <span class=\"math-container\" id=\"q_683\">$k$</span> is the amount of adders in ripple and <span class=\"math-container\" id=\"q_684\">$\\Delta$</span> is the \"delta gate\" (the time that takes to a gate to operate).</p> <p>Clearly you can see that the execution time function is not continuous at all because <span class=\"math-container\" id=\"q_685\">$k$</span> is a natural number and so is <span class=\"math-container\" id=\"q_686\">$n$</span>. This is driving me crazy because on the one hand I understand that I can analyse the function as a continuous one and get results in that way, and indeed I think that's what we do (\"I think\", that's why I am asking), but my intuition and knowledge about mathematical analysis tells me that this is completely wrong, because the truth is that the function is not continuous and will never be and because of that, the derivative with respect to <span class=\"math-container\" id=\"q_687\">$k$</span> or <span class=\"math-container\" id=\"q_688\">$n$</span> does not exist because there is no rate of change.</p> <p>If someone could explain me if my first guess is correct or not and why, I'd appreciate it a lot, thanks for reading and helping!</p>",
  "Title": "Why do engineers use derivatives in discontinuous functions? Is it correct?",
  "Tags": "real-analysis,calculus,functions,derivatives,optimization"
}